### Terraform Plan Details for `dev`

<details><summary>Show Plan</summary>

```terraform
data.cloudinit_config.docker_install: Reading...
data.cloudinit_config.docker_install: Read complete after 0s [id=3844821264]
digitalocean_vpc.main: Refreshing state... [id=4366ef66-bd4f-4a39-8de9-392584011655]
digitalocean_database_cluster.postgres: Refreshing state... [id=5541e491-ddd8-4f77-99b4-db38006df655]
digitalocean_droplet.backend: Refreshing state... [id=519252118]
digitalocean_firewall.backend_fw: Refreshing state... [id=7b8022a8-f198-4d7d-9082-2c8ddd44f5de]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # digitalocean_spaces_bucket.media_uploads will be created
  + resource "digitalocean_spaces_bucket" "media_uploads" {
      + acl                = "public-read"
      + bucket_domain_name = (known after apply)
      + endpoint           = (known after apply)
      + force_destroy      = false
      + id                 = (known after apply)
      + name               = "\"asset-media-space\"-dev"
      + region             = "nyc3"
      + urn                = (known after apply)
    }

  # digitalocean_spaces_bucket_cors_configuration.media_uploads_cors will be created
  + resource "digitalocean_spaces_bucket_cors_configuration" "media_uploads_cors" {
      + bucket = "\"asset-media-space\"-dev"
      + id     = (known after apply)
      + region = "nyc3"

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "DELETE",
              + "GET",
              + "POST",
              + "PUT",
            ]
          + allowed_origins = [
              + "\"http://localhost:3000\"",
            ]
          + expose_headers  = []
            id              = null
          + max_age_seconds = 3000
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + media_bucket_endpoint     = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @davidb-onchain, Action: `pull_request`*